[
  {
    "query": "ofg",
    "success": true,
    "data": [
      {
        "id": "OFG-PD",
        "name": "OFG Bancorp",
        "full_name": "OFG Bancorp",
        "industry": "Banks - Regional",
        "logo_url": "https://img.logo.dev/ticker/OFG-PD?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "OFG Bancorp, a financial holding company, provides various banking and financial services. It operates in three segments: Banking, Wealth Management, and Treasury. The company offers checking and savings accounts, as well as time deposit products; commercial, consumer, auto, and mortgage lending; financial planning; and corporate and individual trust services. It also provides securities brokerage services, including various investment alternatives, such as tax-advantaged fixed income securities, mutual funds, stocks, and bonds to retail and institutional clients; separately-managed accounts and mutual fund asset allocation programs; and pension administration, trust, and other financial services. In addition, the company involves in insurance agency business; administration of retirement plans; various treasury-related functions with an investment portfolio consisting of mortgage-backed securities, obligations of U.S. government sponsored agencies, and money market instruments; and management and participation in public offerings and private placements of debt and equity securities. Further, it offers investment brokerage, investment banking, and money and interest rate risk management, as well as derivatives and borrowings activities. The company operates through a network of 55 branches in Puerto Rico and 2 branches in USVI. OFG Bancorp was founded in 1964 and is based in San Juan, Puerto Rico.",
        "confidence_score": 0.9
      },
      {
        "id": "OFG",
        "name": "OFG Bancorp",
        "full_name": "OFG Bancorp",
        "industry": "Banks - Regional",
        "logo_url": "https://img.logo.dev/ticker/OFG?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "OFG Bancorp, a financial holding company, provides a range of banking and financial services. It operates through three segments: Banking, Wealth Management, and Treasury. The company offers checking and savings accounts, as well as time deposit products; commercial, consumer, auto, and mortgage lending services; financial planning and insurance services; and corporate and individual trust, and retirement services. It also provides securities brokerage and investment advisory services, including various investment alternatives, such as tax-advantaged fixed income securities, mutual funds, stocks, and bonds to retail and institutional clients; and separately-managed accounts and mutual fund asset allocation programs. In addition, the company engages in the insurance agency and reinsurance businesses; administration and servicing of retirement plans; various treasury-related functions with an investment portfolio consisting of mortgage-backed securities, obligations of U.S. government sponsored agencies, and U.S. Treasury securities and money market instruments; and management and participation in public offerings and private placements of debt and equity securities. Further, it offers money management and investment banking services; and engages in the asset/liability management activities, such as purchases and sales of investment securities, interest rate risk management, derivatives, and borrowings. The company operates through a network of 50 branches in Puerto Rico and 2 branches in USVI. OFG Bancorp was founded in 1964 and is headquartered in San Juan, Puerto Rico.",
        "confidence_score": 0.9
      }
    ],
    "total_results": 2,
    "cached_at": "2025-07-28T13:14:50.856957",
    "expires_at": null
  },
  {
    "query": "cognizant",
    "success": true,
    "data": [
      {
        "id": "CTSH",
        "name": "Cognizant Technology Solutions Corporation",
        "full_name": "Cognizant Technology Solutions Corporation",
        "industry": "Information Technology Services",
        "logo_url": "https://img.logo.dev/ticker/CTSH?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "Cognizant Technology Solutions Corporation, a professional services company, provides consulting and technology, and outsourcing services in North America, Europe, and internationally. It operates through four segments: Financial Services; Healthcare; Products and Resources; and Communications, Media and Technology. The company offers customer experience enhancement, robotic process automation, analytics, and AI services in areas, such as digital lending, fraud detection, and next generation payments; the shift towards consumerism, outcome-based contracting, digital health, delivering integrated seamless, omni-channel, and patient-centered experience; and services that drive operational improvements in areas, such as clinical development, pharmacovigilance, and manufacturing, as well as claims processing, enrollment, membership, and billing to healthcare providers and payers, and life sciences companies, including pharmaceutical, biotech, and medical device companies. It also provides solution to manufacturers, retailers and travel and hospitality companies, as well as companies providing logistics, energy and utility services; and digital content, the creation of personalized user experience, and acceleration of digital engineering services to information, media and entertainment, and communications and technology companies. The company was founded in 1994 and is headquartered in Teaneck, New Jersey.",
        "confidence_score": 0.9
      },
      {
        "id": "COZ.DE",
        "name": "Cognizant Technology Solutions Corporation",
        "full_name": "Cognizant Technology Solutions Corporation",
        "industry": "Information Technology Services",
        "logo_url": "https://img.logo.dev/ticker/COZ.DE?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "Cognizant Technology Solutions Corporation, a professional services company, provides consulting and technology, and outsourcing services in North America, Europe, and internationally. It operates through four segments: Financial Services; Healthcare; Products and Resources; and Communications, Media and Technology. The company offers customer experience enhancement, robotic process automation, analytics, and AI services in areas, such as digital lending, fraud detection, and next generation payments; the shift towards consumerism, outcome-based contracting, digital health, delivering integrated seamless, omni-channel, and patient-centered experience; and services that drive operational improvements in areas, such as clinical development, pharmacovigilance, and manufacturing, as well as claims processing, enrollment, membership, and billing to healthcare providers and payers, and life sciences companies, including pharmaceutical, biotech, and medical device companies. It also provides solution to manufacturers, retailers and travel and hospitality companies, as well as companies providing logistics, energy and utility services; and digital content, the creation of personalized user experience, and acceleration of digital engineering services to information, media and entertainment, and communications and technology companies. The company was founded in 1994 and is headquartered in Teaneck, New Jersey.",
        "confidence_score": 0.9
      },
      {
        "id": "0QZ5.L",
        "name": "Cognizant Technology Solutions Corporation",
        "full_name": "Cognizant Technology Solutions Corporation",
        "industry": "Software - Services",
        "logo_url": "https://img.logo.dev/ticker/0QZ5.L?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "Cognizant Technology Solutions Corporation, a professional services company, provides consulting and technology, and outsourcing services in North America, Europe, and internationally. It operates through four segments: Financial Services; Healthcare; Products and Resources; and Communications, Media and Technology. The company offers customer experience enhancement, robotic process automation, analytics, and AI services in areas, such as digital lending, fraud detection, and next generation payments; the shift towards consumerism, outcome-based contracting, digital health, delivering integrated seamless, omni-channel, and patient-centered experience; and services that drive operational improvements in areas, such as clinical development, pharmacovigilance, and manufacturing, as well as claims processing, enrollment, membership, and billing to healthcare providers and payers, and life sciences companies, including pharmaceutical, biotech, and medical device companies. It also provides solution to manufacturers, retailers and travel and hospitality companies, as well as companies providing logistics, energy and utility services; and digital content, the creation of personalized user experience, and acceleration of digital engineering services to information, media and entertainment, and communications and technology companies. The company was founded in 1994 and is headquartered in Teaneck, New Jersey.",
        "confidence_score": 0.9
      }
    ],
    "total_results": 3,
    "cached_at": "2025-07-28T13:19:35.529699",
    "expires_at": null
  },
  {
    "query": "nike",
    "success": true,
    "data": [
      {
        "id": "NKE.NE",
        "name": "NIKE, Inc.",
        "full_name": "NIKE, Inc.",
        "industry": "Apparel - Footwear & Accessories",
        "logo_url": "https://img.logo.dev/ticker/NKE.NE?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; and casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; and licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
        "confidence_score": 0.9
      },
      {
        "id": "NKE.DE",
        "name": "NIKE, Inc.",
        "full_name": "NIKE, Inc.",
        "industry": "Apparel - Footwear & Accessories",
        "logo_url": "https://img.logo.dev/ticker/NKE.DE?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells men's, women's, and kids athletic footwear, apparel, equipment, and accessories worldwide. The company provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; and casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. In addition, it sells a line of performance equipment and accessories comprising bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. The company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel. Additionally, it licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. The company sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was formerly known as Blue Ribbon Sports, Inc. and changed its name to NIKE, Inc. in 1971. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
        "confidence_score": 0.9
      },
      {
        "id": "NKE.BA",
        "name": "NIKE, Inc.",
        "full_name": "NIKE, Inc.",
        "industry": "Apparel - Footwear & Accessories",
        "logo_url": "https://img.logo.dev/ticker/NKE.BA?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; and casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; and licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
        "confidence_score": 0.9
      },
      {
        "id": "NKE",
        "name": "NIKE, Inc.",
        "full_name": "NIKE, Inc.",
        "industry": "Apparel - Footwear & Accessories",
        "logo_url": "https://img.logo.dev/ticker/NKE?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells men's, women's, and kids athletic footwear, apparel, equipment, and accessories worldwide. The company provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; and casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. In addition, it sells a line of performance equipment and accessories comprising bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. The company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel. Additionally, it licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. The company sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was formerly known as Blue Ribbon Sports, Inc. and changed its name to NIKE, Inc. in 1971. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
        "confidence_score": 0.9
      },
      {
        "id": "027740.KS",
        "name": "Maniker.Co.,Ltd",
        "full_name": "Maniker.Co.,Ltd",
        "industry": "Packaged Foods",
        "logo_url": "https://img.logo.dev/ticker/027740.KS?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "Maniker.Co.,Ltd engages in hatching, breeding, slaughtering, and processing of chickens. The company primarily produces and exports various frozen, refrigerated, and retort products, such as meat processed foods, smoked chicken, frozen cooked foods, and ham and sausages. It distributes its products through chicken specialty stores, department stores, hotels, direct management stores, and discount stores, as well as Internet or phone. The company was formerly known as DaeYun Food Co., Ltd. and changed its name to Maniker.Co.,Ltd in October 1998. The company was founded in 1962 and is based in Yongin-si, South Korea.",
        "confidence_score": 0.9
      },
      {
        "id": "LNMG",
        "name": "Linike Medical Group Ltd",
        "full_name": "Linike Medical Group Ltd",
        "industry": "Shell Companies",
        "logo_url": "https://img.logo.dev/ticker/LNMG?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "Linike Medical Group Ltd engages in the renewable energy business. The company is involved in the creation of a solar farm in India. It also focuses on commercial real estate development business. The company was formerly known as Litian Group Inc. and changed its name to Linike Medical Group Ltd in August 2021. Linike Medical Group Ltd is based in Calgary, Canada.",
        "confidence_score": 0.9
      },
      {
        "id": "MLPHO.PA",
        "name": "Photonike Capital S.A.",
        "full_name": "Photonike Capital S.A.",
        "industry": "Financial - Capital Markets",
        "logo_url": "https://img.logo.dev/ticker/MLPHO.PA?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "Photonike Capital SA provides bespoke risk protection solutions in the industrial and financial processes. It offers tailor made solutions for credit enhancement, market hedging, and alternative finance purposes. The company was founded in 2008 and is based in Brussels, Belgium.",
        "confidence_score": 0.9
      },
      {
        "id": "MKLNF",
        "name": "M1 Kliniken AG",
        "full_name": "M1 Kliniken AG",
        "industry": "Medical - Care Facilities",
        "logo_url": "https://img.logo.dev/ticker/MKLNF?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "M1 Kliniken AG, together with its subsidiaries, operates medical centers for aesthetic and plastic surgery in Germany, Austria, the Netherlands, Switzerland, the United Kingdom, Croatia, and Australia. The company operates in two segments, Beauty and Trade. It develops and markets pharmaceutical, medical, and medical technology products for aesthetic medicine and cosmetic dermatology, as well as trades in pharmaceutical, biosimilars, and other medical products and devices in the areas of oncology, HIV, rheumatism, neurology, cardiovascular diseases, and narcotics. The company also engages in the acquisition, management, and sale of real estate, primarily in the health care sector. It offers its products to doctors, pharmacies, and wholesalers under the M1 Select brand. The company operates a network of outpatient specialist centers; and a specialized surgical clinic center, as well as 46 specialist centers under the M1 Med Beauty brand. M1 Kliniken AG was founded in 2007 and is based in Berlin, Germany. M1 Kliniken AG operates as a subsidiary of MPH Health Care AG.",
        "confidence_score": 0.9
      },
      {
        "id": "M12.DE",
        "name": "M1 Kliniken AG",
        "full_name": "M1 Kliniken AG",
        "industry": "Medical - Care Facilities",
        "logo_url": "https://img.logo.dev/ticker/M12.DE?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "M1 Kliniken AG, together with its subsidiaries, operates medical centers for aesthetic and plastic surgery in Germany, Austria, the Netherlands, Switzerland, the United Kingdom, Croatia, and Australia. The company operates in two segments, Beauty and Trade. It develops and markets pharmaceutical, medical, and medical technology products for aesthetic medicine and cosmetic dermatology, as well as trades in pharmaceutical, biosimilars, and other medical products and devices in the areas of oncology, HIV, rheumatism, neurology, cardiovascular diseases, and narcotics. The company also engages in the acquisition, management, and sale of real estate, primarily in the health care sector. It offers its products to doctors, pharmacies, and wholesalers under the M1 Select brand. The company operates a network of outpatient specialist centers; and a specialized surgical clinic center, as well as 46 specialist centers under the M1 Med Beauty brand. M1 Kliniken AG was founded in 2007 and is based in Berlin, Germany. M1 Kliniken AG operates as a subsidiary of MPH Health Care AG.",
        "confidence_score": 0.9
      },
      {
        "id": "MAK.DE",
        "name": "Maternus-Kliniken AG",
        "full_name": "Maternus-Kliniken AG",
        "industry": "Medical - Care Facilities",
        "logo_url": "https://img.logo.dev/ticker/MAK.DE?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "Maternus-Kliniken Aktiengesellschaft operates retirement and nursing homes, rehabilitation clinics, and various service companies that operate in the field of geriatric care and rehabilitation medicine. The company also provides emergency call, assisted living, rehabilitation, and follow-up treatment services, as well as domestic, inpatient, short term, and handicapped care services. It operates approximately 23 facilities in Germany. The company was founded in 1877 and is headquartered in Berlin, Germany.",
        "confidence_score": 0.9
      },
      {
        "id": "LIK.DE",
        "name": "LIMES Schlosskliniken AG",
        "full_name": "LIMES Schlosskliniken AG",
        "industry": "Medical - Care Facilities",
        "logo_url": "https://img.logo.dev/ticker/LIK.DE?token=pk_TVi0kXveSqGUNVDsvdijOA",
        "description": "LIMES Schlosskliniken AG operates private hospitals for psychiatry, psychotherapy, and psychosomatics services. It focuses on the treatment of stress-related illnesses, as well as mental and emotional disorders, such as depression, acute burnout, affective disorders, and trauma. The company is headquartered in Cologne, Germany. LIMES Schlosskliniken AG is a subsidiary of GMF Capital Gmbh.",
        "confidence_score": 0.9
      }
    ],
    "total_results": 11,
    "cached_at": "2025-07-28T14:27:08.261043",
    "expires_at": null
  }
]